package com.sepiagraphic.Services

import com.sepiagraphic.model.AboutWhyUs
import com.sepiagraphic.model.Category
import com.sepiagraphic.model.Polycarbonate

object DataService {
    val services = listOf(
        Category("چاپ استیکر", "ic_sticker"),
        Category("لیبل ژله ای", "ic_jelly"),
        Category("لیبل کاغذی", "ic_paper"),
        Category("لیبل متالایز", "ic_metalizer"),
        Category("چاپ پوستر", "ic_poster"),
        Category("برچسب اموال", "ic_property"),
        Category("چاپ بوم", "ic_bom"),
        Category("لیبل شبرنگ", "ic_shabrang"),
        Category("چاپ کاتری", "ic_kateri"),
        Category("برچسب مش", "ic_mesh"),
        Category("پوستر دیواری", "ic_wallposter"),
        Category("برش کاترپلاتر", "ic_caterplater"),
        Category("استیکر شفاف و مات کن", "ic_shafaf")


    )
    val whyUs = listOf(
        AboutWhyUs("ماشین آلات متنوع و به روز","در مجموعه سپیا طیف وسیعی از ماشین آلات چاپ دیجیتال استفاده میگردد که بهترین و بروزترین از انواع خود بوده و محصولی متنوع و با کیفیت در اختیار مصرف کننده قرار میدهد و مشتریان با توجه به بودجه، کیفیت، و انتظارات خود امکان انتخاب نوع چاپ مورد نظر را دارا میباشند.","icon_printer"),
        AboutWhyUs("متریال مرغوب","تلاش ما در استفاده از طیف وسیعی از متریالها با توجه به نیاز و انتظارات مشتری میباشد. متریال و مرکب های چاپی ما همواره از بهترین انواع موجود در بازار تهیه و استفاده میشود و مشتری امکان انتخاب کاملی را داراست.","icon_material"),
        AboutWhyUs("سفارش آنلاین","در مجموعه سپیا امکان ارسال آنلاین به صورت غیر حضوری و دریافت سفارش پس از اتمام مراحل چاپ برای مشتریان عزیز فراهم میباشد. ","icon_order"),
        AboutWhyUs("نظارت دقیق","از زمان سفارش گیری تا تحویل محصول نهایی در تمامی مراحل (فایل ارسالی، مراحل چاپ و پس از چاپ) سفارش مورد نظر مورد بازبینی و اصلاح قرار گرفته و ایرادات احتمالی رفع میگردد تا محصول نهایی با بهترین کیفیت در اختیار مشتریان عزیز قرار گیرد.","icon_nezarat"),
        AboutWhyUs("تحویل فوری"," امکان تحویل فوری سفارشات با توجه به ظرفیت بالای ماشین آلات و نیروی انسانی به صورت شبانه روزی فراهم بوده و سفرشات مشتریان عزیز در اسرع وقت تحویل میگردد.","icon_fast"),
        AboutWhyUs("ارسال به سراسر کشور","با توجه به امکان سفارش غیر حضوری، پس از اتمام مراحل چاپ، محصول نهایی بسته بندی و از طرق مختلف (با توجه به نظر مشتری) در اسرع وقت به سراسر کشور ارسال و تحویل میگردد.","icon_send")
    )

    val polycarbonate = listOf(
        Polycarbonate("دو طرف مات","– مناسب دستگاه های صنعتی با شرایط محیطی سخت","– قسمت نمایشگر مات ( قابل استفاده در نمایشگرهای سون سگمنت)","– مقاومت بسیار بالا در برابر خط و خش","– سطح کاملا مات"),
        Polycarbonate("نیمه براق – نیمه مات","– مناسب کلیه دستگاه های صنعتی و نیمه صنعتی","– قسمت نمایشگر نیمه شفاف، در صورت چسبیدن کامل به نمایشگر کاملا خوانا و شفاف خواهد بود." ,"– مقاومت مناسب در برابر خط و خش","– سطح نیمه براق"),
        Polycarbonate("دو طرفه براق","– مناسب کارهای فانتزی، لوازم خانگی، دستگاه های بستنی و …","– قسمت ال سی دی کاملا شفاف، با قابلیت استفاده جهت نمایشگرهای رنگی و تاچ","– مقاومت کمتر در مقابل خط و خش","")
    )



}